package com.lec.ex01_class;

public class 클래스 {
/*
	- 객체
	객체란 물리적으로 존재하거나 개념적인 것 중에서 다른 것과 식별 가능한 것.
	객체는 속성과 동작으로 구성. 자바는 이러한 속성과 동작을 각각 필드와 메소드라고 부름.
	
	- 객체지향프로그래밍(OOP)
	객체 객체들을 먼저 만들고, 이 객체들을 하나씩 조립해서 완성된 프로그램을 만드는 기법.
	
	- 객체의 상호작용
	- 객체 간의 관계
	- 객체 지향 프로그래밍의 특징
	- 클래스와 인스턴스
	- 클래스 선언
	- 클래스 변수
	- 생성자, 필드, 메소드
	 	필드 : 
	 	생성자 : 
	 	메서드 :
 	- 필드 - 필드선언 : 필드는 클래스 블록에서 선언되어야한다.
 						타입은 필드에 저장할 데이터의 종류를 결정. 기본타입, 참조타입 모두 가능
 						초기값을 제공하지않을 경우 필드는 객체생성 시 자동으로 기본값으로 초기화
		   - 필드사용 : 
	- 생성자 
*/	
}
